{
    "✨ 2024": [
        "Williams, B. and Headleand, C.J., 2024, March. Visuo-vestibular Congruency Impacts on Player Experiences in Virtual Reality. In 2024 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW) (pp. 863-864). IEEE.",
        "Williams, B., Oliver, T., Ward, D. and Headleand, C.J., 2024, July. Real-time Data-Oriented Virtual Forestry Simulation for Games. In 42nd Computer Graphics and Visual Computing Conference (CGVC), 2024, Eurographics."
    ],

    "2023": [
        "Williams, B., 2023. Towards a communication protocol for motion simulators in virtual reality. Animex Research and Innovation Conference 2023."
    ],
    
    "2021": [
        "Roe, C., Lowe, M., Williams, B. and Miller, C., 2021. Public perception of SARS-CoV-2 vaccinations on social media: Questionnaire and sentiment analysis. International Journal of Environmental Research and Public Health, 18(24), p.13028.",
        "Williams, B. and Headleand, C.J., 2021. Recreational Motion Simulation: A New Frontier for Virtual Worlds Research.",
        "Headleand, C.J., Davies, B. and Williams, B., 2021. Adi's Maze and the Research Arcade: A Long-term Study on the Impact of Gendered Representation on Player Preferences.",
        "Headleand, C.J., Davies, B., Threlfall, D. and Williams, B., 2021. The University on Lincoln Island: Reimagining a University Campus as a Role-Playing Video Game."
    ],

    "2020": [
        "Williams, B., Garton, A.E. and Headleand, C.J., 2020, September. Exploring visuo-haptic feedback congruency in virtual reality. In 2020 International Conference on Cyberworlds (CW) (pp. 102-109). IEEE.",
        "Williams, B., Ritsos, P.D. and Headleand, C., 2020. Virtual forestry generation: Evaluating models for tree placement in games. Computers, 9(1), p.20.",
        "Headleand, C., Williams, B., Holopainen, J. and Gilliam, M., 2020. A Gesture Recognition Model for Virtual Reality Motion Controllers."
    ],

    "2019": [
        "Harrington, J., Williams B. and Headleand, C., 2019. A somatic approach to combating cybersickness utilising airflow feedback.",
        "Williams, B. and Headleand, C., 2019. Evaluating Models for Virtual Forestry Generation and Tree Placement in Games."
    ],

    "2018": [
        "Gerling, K., Hicks, K., Buttrick, L., Headleand, C., Williams, B., Hall, J., Tang, K., Geurts, L. and Chen, W., 2018, October. Potential and limitations of playful technology to support infant feeding. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts (pp. 431-437)."
    ],

    "2017": [
        "Hall, J.A., Williams, B. and Headleand, C.J., 2017, September. Artificial folklore for simulated religions. In 2017 International Conference on Cyberworlds (CW) (pp. 229-232). IEEE.",
        "Williams, B. and Headleand, C.J., 2017, September. A time-line approach for the generation of simulated settlements. In 2017 International Conference on Cyberworlds (CW) (pp. 134-141). IEEE."
    ],

    "2016": [
        "Headleand, C.J., Jackson, J., Williams, B., Priday, L., Teahan, W.J. and Ap Cenydd, L., 2016. How the perceived identity of a npc companion influences player behavior. Transactions on Computational Science XXVIII: Special Issue on Cyberworlds and Cybersecurity, pp.88-107.",
        "Williams, B., Jackson, J., Hall, J. and Headleand, C.J., 2018. Modular Games AI Benchmark. In Artificial Life and Intelligent Agents: Second International Symposium, ALIA 2016, Birmingham, UK, June 14-15, 2016, Revised Selected Papers 2 (pp. 138-142). Springer International Publishing."
    ]
}